semantic search, doc update
